garyPenhook/PyAvrOCD/svd/avr32ea48.svd
        <register>
          <name>USERCCLLUT1B</name>
          <description>CCL1 Event B</description>
          <addressOffset>0x23</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERCCLLUT2A</name>
          <description>CCL2 Event A</description>
          <addressOffset>0x24</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERCCLLUT2B</name>
          <description>CCL2 Event B</description>
          <addressOffset>0x25</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERCCLLUT3A</name>
          <description>CCL3 Event A</description>
          <addressOffset>0x26</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USERCCLLUT3B</name>
          <description>CCL3 Event B</description>
          <addressOffset>0x27</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTA</name>
          <description>EVOUTA</description>
          <addressOffset>0x29</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTB</name>
          <description>EVOUTB</description>
          <addressOffset>0x2A</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTC</name>
          <description>EVOUTC</description>
          <addressOffset>0x2B</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTD</name>
          <description>EVOUTD</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>USEREVSYSEVOUTE</name>
          <description>EVOUTE</description>
          <addressOffset>0x2D</addressOffset>
          <size>0x8</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>USER</name>
              <description>User channel select</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
              <writeConstraint>
                <useEnumeratedValues>true</useEnumeratedValues>
              </writeConstraint>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OFF</name>
                  <description>Off, No Eventsys Channel connected</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL0</name>
                  <description>Connect user to event channel 0</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL1</name>
                  <description>Connect user to event channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL2</name>
                  <description>Connect user to event channel 2</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL3</name>
                  <description>Connect user to event channel 3</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL4</name>
                  <description>Connect user to event channel 4</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CHANNEL5</name>
                  <description>Connect user to event channel 5</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
